In [1]:
import numpy as np
import pandas as pd

In [2]:
# 查看pandas的版本
pd.__version__

'1.1.5'

# 一、文件读取和写入

### 1. 文件读取
`读取csv、excel、txt文件`
```
csv：read_csv()
excel：read_excel()
txt：read_tabel(, engine='python')
```
`公共参数：`
```
header=None 表示第一行不作为列名
index_col 表示把某一列或几列作为索引 
usecols 表示读取列的集合，默认读取所有的列
parse_dates 表示需要转化为时间的列（时间序列）
nrows 表示读取的数据行数
```

![my_csv](1.png)

In [3]:
pd.read_csv('../data/my_csv.csv')

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

In [4]:
pd.read_table('../data/my_table.txt')

   col1 col2  col3             col4
0     2    a   1.4   apple 2020/1/1
1     3    b   3.4  banana 2020/1/2
2     6    c   2.5  orange 2020/1/5
3     5    d   3.2   lemon 2020/1/7

In [5]:
pd.read_excel('../data/my_excel.xlsx')

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

在读取 txt 文件时，经常遇到**分隔符非空格**的情况， read_table 有一个**分割参数 sep** ，可自定义分割符号，进行 txt 数据的读取。<br>
**需要注意**
```
参数 sep 中使用的是正则表达式
如下分割 ||||， 需写对应的转移符号  \|\|\|\|。
```
例如，下面的读取的表以 |||| 为分割：

In [6]:
pd.read_table('../data/my_table_special_sep.txt') 
# 当成一列元素

              col1 |||| col2
0  TS |||| This is an apple.
1    GQ |||| My name is Bob.
2         WT |||| Well done!
3    PT |||| May I help you?

In [7]:
# 变成俩列
# 同时需要指定引擎为 python 
pd.read_table('../data/my_table_special_sep.txt', sep=' \|\|\|\| ', engine='python')

  col1               col2
0   TS  This is an apple.
1   GQ    My name is Bob.
2   WT         Well done!
3   PT    May I help you?

In [8]:
# 第一行不作为列名, 则默认添加 0， 1， 2， 3...作为列名
pd.read_table('../data/my_table.txt', header=None)

      0     1     2                3
0  col1  col2  col3             col4
1     2     a   1.4   apple 2020/1/1
2     3     b   3.4  banana 2020/1/2
3     6     c   2.5  orange 2020/1/5
4     5     d   3.2   lemon 2020/1/7

In [9]:
# 把第一列、二列作为索引 
data = pd.read_csv('../data/my_csv.csv', index_col=['col1', 'col2'])
data

           col3    col4      col5
col1 col2
2    a      1.4   apple  2020/1/1
3    b      3.4  banana  2020/1/2
6    c      2.5  orange  2020/1/5
5    d      3.2   lemon  2020/1/7

In [10]:
data["col3"]

col1  col2
2     a       1.4
3     b       3.4
6     c       2.5
5     d       3.2
Name: col3, dtype: float64

In [11]:
# 需要转化为时间的列（时间序列）
pd.read_csv('../data/my_csv.csv', parse_dates=['col5'])

   col1 col2  col3    col4       col5
0     2    a   1.4   apple 2020-01-01
1     3    b   3.4  banana 2020-01-02
2     6    c   2.5  orange 2020-01-05
3     5    d   3.2   lemon 2020-01-07

In [12]:
# 读取的数据行数
pd.read_excel('../data/my_excel.xlsx', nrows=2)

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2

In [13]:
# 表示读取列的集合，默认读取所有的列
pd.read_table('../data/my_table.txt', usecols=['col1', 'col2'])

   col1 col2
0     2    a
1     3    b
2     6    c
3     5    d

### 2. 写入文件
**一般在数据写入中，最常用的操作是把 index 设置为 False ，特别当索引没有特殊意义的时候。**
```
csv、txt：to_csv()
txt没有to_table()函数，但是to_csv()可以写入txt文件，且允许允许自定义分隔符sep。
```

In [14]:
data = pd.read_csv('../data/my_csv.csv')
print(data)
# 完全写进去，和初始文件不一样
data.to_csv("x.csv")

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

![](2.png)

In [15]:
data = pd.read_csv('../data/my_csv.csv')
print(data)
# 写入文件时， 将index索引去掉
data.to_csv("xx.csv", index = False)

   col1 col2  col3    col4      col5
0     2    a   1.4   apple  2020/1/1
1     3    b   3.4  banana  2020/1/2
2     6    c   2.5  orange  2020/1/5
3     5    d   3.2   lemon  2020/1/7

![](3.png)

In [16]:
data = pd.read_table('../data/my_table_special_sep.txt', sep=' \|\|\|\| ', engine='python')
data

  col1               col2
0   TS  This is an apple.
1   GQ    My name is Bob.
2   WT         Well done!
3   PT    May I help you?

In [17]:
# 自定义分隔符，注意index False
data.to_csv("my_to_txt.txt", sep = "\t", index = False)

如果想要把表格快速转换为 **markdown 和 latex 语言**，可以使用 **to_markdown 和 to_latex 函数**，此处需要
安装 tabulate 包。<br>
`pip install tabulate`

In [18]:
print(data.to_markdown())

|    | col1   | col2              |
|---:|:-------|:------------------|
|  0 | TS     | This is an apple. |
|  1 | GQ     | My name is Bob.   |
|  2 | WT     | Well done!        |
|  3 | PT     | May I help you?   |

# 二、基本数据结构

pandas 中具有两种基本的数据存储结构
```
存储一维 values 的 Series
存储二维 values 的 DataFrame 
```

### 1. Series

Series 一般由四个部分组成:
```
序列的值 data
索引 index（可指定它的名字，默认为空）
存储类型 dtype 
序列的名字 name 。
```

#### 1）创建Series

In [19]:
s = pd.Series(data = [100, 'a', {'dic1':5}],
                index = pd.Index(['id1', 20, 'third'], name='my_idx'),
                dtype = 'object',
                name = 'my_name')

In [20]:
s

my_idx
id1              100
20                 a
third    {'dic1': 5}
Name: my_name, dtype: object

#### 2）获取Series属性

获取属性s.values，并非方法s.values()

In [21]:
print(s.values, s.index, s.dtype, s.name, s.shape, sep = "\n")

[100 'a' {'dic1': 5}]
Index(['id1', 20, 'third'], dtype='object', name='my_idx')
object
my_name
(3,)

#### 3）Series的索引

对于Series可以通过 **[index_item]**可以取出对应的行

In [22]:
print(s["id1"], s[20], s["third"], sep = "\n")

100
a
{'dic1': 5}

### 2. DataFrame

DataFrame 在 Series 的基础上增加了**列索引**， 即由**二维的 data 与行列索引**来构造
```
data
index
columns
```

#### 1）创建DataFrame

In [23]:
data = [[1, 'a', 1.2], [2, 'b', 2.2], [3, 'c', 3.2]]
df = pd.DataFrame(data = data,
                     index = ['row_%d'%i for i in range(3)],
                     columns=['col_0', 'col_1', 'col_2'])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

更多的时候会采用从**列索引名到数据的映射**` （字典） `来构造数据框，同时再加上行索引

In [24]:
df = pd.DataFrame(data = {'col_0': [1,2,3]
                          , 'col_1':list('abc')
                          , 'col_2': [1.2, 2.2, 3.2]}
                          , index = ['row_%d'%i for i in range(3)])
df

       col_0 col_1  col_2
row_0      1     a    1.2
row_1      2     b    2.2
row_2      3     c    3.2

#### 2）DataFrame的列索引

In [25]:
# 取出单个，返回值是带有index和对应列的Series
df["col_2"]

row_0    1.2
row_1    2.2
row_2    3.2
Name: col_2, dtype: float64

In [26]:
# 取出多个列，并返回值仍是对应的DataFrame
# 注意和取出单个列的区别
df[["col_0", "col_2"]]

       col_0  col_2
row_0      1    1.2
row_1      2    2.2
row_2      3    3.2

#### 3）获取DataFrame属性

获取属性df.values，并非方法df.values()

In [27]:
print(df.values, df.index, df.columns, df.dtypes, df.shape, sep = "\n")

[[1 'a' 1.2]
 [2 'b' 2.2]
 [3 'c' 3.2]]
Index(['row_0', 'row_1', 'row_2'], dtype='object')
Index(['col_0', 'col_1', 'col_2'], dtype='object')
col_0      int64
col_1     object
col_2    float64
dtype: object
(3, 3)

#### 4）DataFrane的转置T

In [28]:
df.T

      row_0 row_1 row_2
col_0     1     2     3
col_1     a     b     c
col_2   1.2   2.2   3.2

# 三、常用基本函数

```
汇总函数      head, tail, info, describe
特征统计函数  sum, mean, median, var, std, max, min
唯一值函数    unique, nunique, value_counts, drop_duplicate, duplicated
替换函数      replace, where, mask
排序函数
apply方法
```

### 1. 汇总函数

```
head、tail
info
describe
```

In [29]:
df = pd.read_csv('../data/learn_pandas.csv')
df

,School,Grade,Name,Gender,Height,Weight,Transfer,Test_Number,Test_Date,Time_Record
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N,1,2019/10/5,0:04:34
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N,1,2019/9/4,0:04:20
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N,2,2019/9/12,0:05:22
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N,2,2020/1/3,0:04:08
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N,2,2019/11/6,0:05:22
...,...,...,...,...,...,...,...,...,...,...
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N,2,2019/10/17,0:04:31
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N,3,2019/9/22,0:04:03
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N,1,2020/1/5,0:04:48
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N,2,2020/1/7,0:04:58
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N,1,2019/11/6,0:05:05

In [30]:
df.columns

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer',
       'Test_Number', 'Test_Date', 'Time_Record'],
      dtype='object')

In [31]:
df.columns[:7]

Index(['School', 'Grade', 'Name', 'Gender', 'Height', 'Weight', 'Transfer'], dtype='object')

In [32]:
df = df[df.columns[:7]]
df.head(2)

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N

In [33]:
df.head(5)

,School,Grade,Name,Gender,Height,Weight,Transfer
0,Shanghai Jiao Tong University,Freshman,Gaopeng Yang,Female,158.9,46.0,N
1,Peking University,Freshman,Changqiang You,Male,166.5,70.0,N
2,Shanghai Jiao Tong University,Senior,Mei Sun,Male,188.9,89.0,N
3,Fudan University,Sophomore,Xiaojuan Sun,Female,NaN,41.0,N
4,Fudan University,Sophomore,Gaojuan You,Male,174.0,74.0,N

In [34]:
df.tail(5)

,School,Grade,Name,Gender,Height,Weight,Transfer
195,Fudan University,Junior,Xiaojuan Sun,Female,153.9,46.0,N
196,Tsinghua University,Senior,Li Zhao,Female,160.9,50.0,N
197,Shanghai Jiao Tong University,Senior,Chengqiang Chu,Female,153.9,45.0,N
198,Shanghai Jiao Tong University,Senior,Chengmei Shen,Male,175.3,71.0,N
199,Tsinghua University,Sophomore,Chunpeng Lv,Male,155.7,51.0,N

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   School    200 non-null    object
 1   Grade     200 non-null    object
 2   Name      200 non-null    object
 3   Gender    200 non-null    object
 4   Height    183 non-null    float64
 5   Weight    189 non-null    float64
 6   Transfer  188 non-null    object
dtypes: float64(2), object(5)
memory usage: 11.1+ KB

In [36]:
df.describe()

           Height      Weight
count  183.000000  189.000000
mean   163.218033   55.015873
std      8.608879   12.824294
min    145.400000   34.000000
25%    157.150000   46.000000
50%    161.900000   51.000000
75%    167.500000   65.000000
max    193.900000   89.000000

### 2. 特征统计函数

```
sum
mean
median
var
std
max
min
它们有一个公共参数 axis ，默认为 0 代表逐列聚合，如果设置为 1 则表示逐行聚合
```

In [37]:
# 取出身高和体重数值类型进行演示
df_ = df[["Height", "Weight"]]
df_.head(2)

   Height  Weight
0   158.9    46.0
1   166.5    70.0

In [38]:
df_.mean()

Height    163.218033
Weight     55.015873
dtype: float64

In [39]:
df_.max()

Height    193.9
Weight     89.0
dtype: float64

In [40]:
# 分位数
df_.quantile(0.75)

Height    167.5
Weight     65.0
Name: 0.75, dtype: float64

In [41]:
# 非缺失值个数
df_.count()

Height    183
Weight    189
dtype: int64

In [42]:
# 最大值对应的索引
df_.idxmax()

Height    193
Weight      2
dtype: int64

In [43]:
df_.idxmin()

Height    143
Weight     49
dtype: int64

In [44]:
df_.mean(axis = 1).head()# 在这个数据集上体重和身高的均值并没有意义

0    102.45
1    118.25
2    138.95
3     41.00
4    124.00
dtype: float64

### 3. 唯一值函数

```
unique
nunique
drop_duplicates
```

In [45]:
# 取出School这列数据, 并去重
df['School'].unique()

array(['Shanghai Jiao Tong University', 'Peking University',
       'Fudan University', 'Tsinghua University'], dtype=object)

In [46]:
df['School'].unique().shape[0]

4

In [47]:
# 取出唯一值的个数
df["School"].nunique()

4

观察一列(Series)或多个列组合的唯一值，可以使用 **drop_duplicates**
```
关键参数 keep
first 默认值,表示每个组合保留第一次出现的所在行
last  表示保留最后一次出现的所在行
False 表示把所有重复组合所在的行剔除
```
返回是数据所在的行, 仍是一个DataFrame或Series, 而非List

**注意**: 这里取了三列数据, 并将drop_duplicates函数作用于两列上, 左后统计该两列的唯一性,和第三列无关

In [48]:
df_demo = df[['Gender','Transfer','Name']]
df_demo.drop_duplicates(['Gender', 'Transfer'])

    Gender Transfer            Name
0   Female        N    Gaopeng Yang
1     Male        N  Changqiang You
12  Female      NaN        Peng You
21    Male      NaN   Xiaopeng Shen
36    Male        Y    Xiaojuan Qin
43  Female        Y      Gaoli Feng

In [49]:
df_demo = df[['Gender','Transfer','Name']]
df_demo.drop_duplicates(['Gender', 'Transfer'], keep = "last")

     Gender Transfer            Name
147    Male      NaN        Juan You
150    Male        Y   Chengpeng You
169  Female        Y   Chengquan Qin
194  Female      NaN     Yanmei Qian
197  Female        N  Chengqiang Chu
199    Male        N     Chunpeng Lv

In [50]:
df_demo.drop_duplicates(['Name', 'Gender'],
                        keep=False).head() # 保留只出现过一次的性别和姓名组合

   Gender Transfer            Name
0  Female        N    Gaopeng Yang
1    Male        N  Changqiang You
2    Male        N         Mei Sun
4    Male        N     Gaojuan You
5  Female        N     Xiaoli Qian

In [51]:
df_demo = df[['Gender','Transfer']]
df_demo.drop_duplicates(['Gender', 'Transfer'])

    Gender Transfer
0   Female        N
1     Male        N
12  Female      NaN
21    Male      NaN
36    Male        Y
43  Female        Y

来自我的数据对unique和drop_duplicates的测试

In [52]:
data = pd.DataFrame(data = {1 : [1, 2, 3, 1]
                   , 2:[2, 3, 4, 2]
                   , 3:[2, 4, 5, 2]}
                   )
data

   1  2  3
0  1  2  2
1  2  3  4
2  3  4  5
3  1  2  2

In [53]:
data[1].unique()

array([1, 2, 3], dtype=int64)

In [54]:
data.drop_duplicates([1, 2])

   1  2  3
0  1  2  2
1  2  3  4
2  3  4  5

In [55]:
data.drop_duplicates([1, 2], keep = "last")

   1  2  3
1  2  3  4
2  3  4  5
3  1  2  2

In [56]:
# 返回是一个Series
df['School'].drop_duplicates() # 在 Series 上也可以使用

0    Shanghai Jiao Tong University
1                Peking University
3                 Fudan University
5              Tsinghua University
Name: School, dtype: object

In [57]:
# 返回是个List
df["School"].unique()

array(['Shanghai Jiao Tong University', 'Peking University',
       'Fudan University', 'Tsinghua University'], dtype=object)